site.org
#+HUGO_BASE_DIR: .
#+MACRO: uva @@hugo:{{<UVa2 number="$1" >}}@@


** Network Flow
:PROPERTIES:
:EXPORT_FILE_NAME: network-flow
:EXPORT_DATE: 2023-02-27
:ID:       0422089d-5d4e-4d32-bed1-d0a4dfb47870
:END:

The Edmonds-Karp algorithm is a popular and efficient algorithm used to solve the max-flow problem in network flow
theory. This algorithm is an extension of the Ford-Fulkerson algorithm, which is a simple algorithm for finding the
maximum flow in a network. The Edmonds-Karp algorithm uses a breadth-first search approach to find the shortest
augmenting path in the residual graph, making it faster and more efficient than the original Ford-Fulkerson algorithm.

*** Slides

- [[/slides/edmonds-karp.pdf][Edmonds Karp]]

