content/lectures/network-flow.md
+++
title = "Network Flow"
author = ["Mattox Beckman"]
date = 2023-02-27
draft = false
+++

The Edmonds-Karp algorithm is a popular and efficient algorithm used to solve the max-flow problem in network flow
theory. This algorithm is an extension of the Ford-Fulkerson algorithm, which is a simple algorithm for finding the
maximum flow in a network. The Edmonds-Karp algorithm uses a breadth-first search approach to find the shortest
augmenting path in the residual graph, making it faster and more efficient than the original Ford-Fulkerson algorithm.


## Slides {#slides}

-   [Edmonds Karp](/slides/edmonds-karp.pdf)
